{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 80, 80], "dtype": "float32", "sparse": false, "ragged": false, "name": "input.1"}, "name": "input.1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "584_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "584_pad", "inbound_nodes": [[["input.1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "584", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "584", "inbound_nodes": [[["584_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "374", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "374", "inbound_nodes": [[["584", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "587_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "587_pad", "inbound_nodes": [[["374", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "587", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "587", "inbound_nodes": [[["587_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "378", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "378", "inbound_nodes": [[["587", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "590", "trainable": true, "dtype": "float32", "filters": 103, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "590", "inbound_nodes": [[["378", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "382", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "382", "inbound_nodes": [[["590", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "593_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "593_pad", "inbound_nodes": [[["382", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "593", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "593", "inbound_nodes": [[["593_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "386", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "386", "inbound_nodes": [[["593", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "596", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "596", "inbound_nodes": [[["386", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "599", "trainable": true, "dtype": "float32", "filters": 13, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "599", "inbound_nodes": [[["596", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "392", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "392", "inbound_nodes": [[["599", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "602_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "602_pad", "inbound_nodes": [[["392", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "602", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "602", "inbound_nodes": [[["602_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "396", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "396", "inbound_nodes": [[["602", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "605", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "605", "inbound_nodes": [[["396", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "399", "trainable": true, "dtype": "float32"}, "name": "399", "inbound_nodes": [[["596", 0, 0, {}], ["605", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "608", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "608", "inbound_nodes": [[["399", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "403", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "403", "inbound_nodes": [[["608", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "611_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "611_pad", "inbound_nodes": [[["403", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "611", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "611", "inbound_nodes": [[["611_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "407", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "407", "inbound_nodes": [[["611", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "614", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "614", "inbound_nodes": [[["407", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "410", "trainable": true, "dtype": "float32"}, "name": "410", "inbound_nodes": [[["399", 0, 0, {}], ["614", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "617", "trainable": true, "dtype": "float32", "filters": 13, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "617", "inbound_nodes": [[["410", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "414", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "414", "inbound_nodes": [[["617", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "620_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "620_pad", "inbound_nodes": [[["414", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "620", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "620", "inbound_nodes": [[["620_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "418", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "418", "inbound_nodes": [[["620", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "623", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "623", "inbound_nodes": [[["418", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "421", "trainable": true, "dtype": "float32"}, "name": "421", "inbound_nodes": [[["410", 0, 0, {}], ["623", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "626", "trainable": true, "dtype": "float32", "filters": 52, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "626", "inbound_nodes": [[["421", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "425", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "425", "inbound_nodes": [[["626", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "629_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "629_pad", "inbound_nodes": [[["425", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "629", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "629", "inbound_nodes": [[["629_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "429", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "429", "inbound_nodes": [[["629", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "632", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "632", "inbound_nodes": [[["429", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "432", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "432", "inbound_nodes": [[["632", 0, 0, {}]]]}, {"class_name": "Antirectifier", "config": {"name": "432_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+jpEOi9hbmFjb25kYS9saWIvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFz\nL3Bvb2xpbmdfbGF5ZXJzLnB52gx0YXJnZXRfbGF5ZXKYAAAAcwQAAAAAAQwB\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "432_EXPAND1", "inbound_nodes": [[["432", 0, 0, {}]]]}, {"class_name": "Antirectifier", "config": {"name": "432_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+jpEOi9hbmFjb25kYS9saWIvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFz\nL3Bvb2xpbmdfbGF5ZXJzLnB52gx0YXJnZXRfbGF5ZXKYAAAAcwQAAAAAAQwB\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "432_EXPAND2", "inbound_nodes": [[["432_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "635", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "635", "inbound_nodes": [[["432_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "435", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "435", "inbound_nodes": [[["635", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "638", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "638", "inbound_nodes": [[["435", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "438", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "438", "inbound_nodes": [[["638", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "439", "trainable": true, "dtype": "float32"}, "name": "439", "inbound_nodes": [[["632", 0, 0, {}], ["438", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "440", "trainable": true, "dtype": "float32"}, "name": "440", "inbound_nodes": [[["421", 0, 0, {}], ["439", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "641", "trainable": true, "dtype": "float32", "filters": 231, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "641", "inbound_nodes": [[["440", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "444", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "444", "inbound_nodes": [[["641", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "644_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "644_pad", "inbound_nodes": [[["444", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "644", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "644", "inbound_nodes": [[["644_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "448", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "448", "inbound_nodes": [[["644", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "647", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "647", "inbound_nodes": [[["448", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "650", "trainable": true, "dtype": "float32", "filters": 154, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "650", "inbound_nodes": [[["647", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "454", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "454", "inbound_nodes": [[["650", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "653_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "653_pad", "inbound_nodes": [[["454", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "653", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "653", "inbound_nodes": [[["653_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "458", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "458", "inbound_nodes": [[["653", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "656", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "656", "inbound_nodes": [[["458", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "461", "trainable": true, "dtype": "float32"}, "name": "461", "inbound_nodes": [[["647", 0, 0, {}], ["656", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "659", "trainable": true, "dtype": "float32", "filters": 52, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "659", "inbound_nodes": [[["461", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "465", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "465", "inbound_nodes": [[["659", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "662_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "662_pad", "inbound_nodes": [[["465", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "662", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "662", "inbound_nodes": [[["662_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "469", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "469", "inbound_nodes": [[["662", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "665", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "665", "inbound_nodes": [[["469", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "472", "trainable": true, "dtype": "float32"}, "name": "472", "inbound_nodes": [[["461", 0, 0, {}], ["665", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "668", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "668", "inbound_nodes": [[["472", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "476", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "476", "inbound_nodes": [[["668", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "671_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "671_pad", "inbound_nodes": [[["476", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "671", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "671", "inbound_nodes": [[["671_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "480", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "480", "inbound_nodes": [[["671", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "674", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "674", "inbound_nodes": [[["480", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "483", "trainable": true, "dtype": "float32"}, "name": "483", "inbound_nodes": [[["472", 0, 0, {}], ["674", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "677", "trainable": true, "dtype": "float32", "filters": 52, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "677", "inbound_nodes": [[["483", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "487", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "487", "inbound_nodes": [[["677", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "680_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "680_pad", "inbound_nodes": [[["487", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "680", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "680", "inbound_nodes": [[["680_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "491", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "491", "inbound_nodes": [[["680", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "683", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "683", "inbound_nodes": [[["491", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "494", "trainable": true, "dtype": "float32"}, "name": "494", "inbound_nodes": [[["483", 0, 0, {}], ["683", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "686", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "686", "inbound_nodes": [[["494", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "498", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "498", "inbound_nodes": [[["686", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "689_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "689_pad", "inbound_nodes": [[["498", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "689", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "689", "inbound_nodes": [[["689_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "502", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "502", "inbound_nodes": [[["689", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "692", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "692", "inbound_nodes": [[["502", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "505", "trainable": true, "dtype": "float32"}, "name": "505", "inbound_nodes": [[["494", 0, 0, {}], ["692", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "695", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "695", "inbound_nodes": [[["505", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "509", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "509", "inbound_nodes": [[["695", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "698_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "698_pad", "inbound_nodes": [[["509", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "698", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "698", "inbound_nodes": [[["698_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "513", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "513", "inbound_nodes": [[["698", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "701", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "701", "inbound_nodes": [[["513", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "516", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "516", "inbound_nodes": [[["701", 0, 0, {}]]]}, {"class_name": "Antirectifier", "config": {"name": "516_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+jpEOi9hbmFjb25kYS9saWIvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFz\nL3Bvb2xpbmdfbGF5ZXJzLnB52gx0YXJnZXRfbGF5ZXKYAAAAcwQAAAAAAQwB\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "516_EXPAND1", "inbound_nodes": [[["516", 0, 0, {}]]]}, {"class_name": "Antirectifier", "config": {"name": "516_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+jpEOi9hbmFjb25kYS9saWIvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFz\nL3Bvb2xpbmdfbGF5ZXJzLnB52gx0YXJnZXRfbGF5ZXKYAAAAcwQAAAAAAQwB\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "516_EXPAND2", "inbound_nodes": [[["516_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "704", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "704", "inbound_nodes": [[["516_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "519", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "519", "inbound_nodes": [[["704", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "707", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "707", "inbound_nodes": [[["519", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "522", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "522", "inbound_nodes": [[["707", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "523", "trainable": true, "dtype": "float32"}, "name": "523", "inbound_nodes": [[["701", 0, 0, {}], ["522", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "524", "trainable": true, "dtype": "float32"}, "name": "524", "inbound_nodes": [[["505", 0, 0, {}], ["523", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "710", "trainable": true, "dtype": "float32", "filters": 308, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "710", "inbound_nodes": [[["524", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "528", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "528", "inbound_nodes": [[["710", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "713_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "713_pad", "inbound_nodes": [[["528", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "713", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "713", "inbound_nodes": [[["713_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "532", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "532", "inbound_nodes": [[["713", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "716", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "716", "inbound_nodes": [[["532", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "719", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "719", "inbound_nodes": [[["716", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "538", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "538", "inbound_nodes": [[["719", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "722_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "722_pad", "inbound_nodes": [[["538", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "722", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "722", "inbound_nodes": [[["722_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "542", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "542", "inbound_nodes": [[["722", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "725", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "725", "inbound_nodes": [[["542", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "545", "trainable": true, "dtype": "float32"}, "name": "545", "inbound_nodes": [[["716", 0, 0, {}], ["725", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "728", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "728", "inbound_nodes": [[["545", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "549", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "549", "inbound_nodes": [[["728", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "731_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "731_pad", "inbound_nodes": [[["549", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "731", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "731", "inbound_nodes": [[["731_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "553", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "553", "inbound_nodes": [[["731", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "734", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": 